-- 打散数组
local function randomSort(arr)
    local dic = {}
    local function sorter(a, b)
        local a1 = dic[a];
        if not a1 then
            a1 = math.random()
            dic[a] = a1
        end

        local b1 = dic[b];
        if not b1 then
            b1 = math.random()
            dic[b] = b1
        end

        return a1 < b1;
    end

    table.sort( arr, sorter )

    return arr;
end


LOADING_SENTENCES_ARR = {
    "晚一步不如早一步，问题您来了！",
    "玩是高尚娱乐，博是低级趣味",
    "世界上最美的湖，是碰碰湖",
    "现在的一切美好事物,无一不是创新的结果",
    "敢于下注，赢家永远属于您！",
    "打鱼靠技术，心态不能急，手不能抖！",
    "世界上最漂亮的花，是杠上开花",
    "永不言败，推倒再来",
    "输了不投降，竞争意识强",
    "输赢都不走，能做一把手",
    "游戏开始后的感觉就像回家一样，so  sweet",
    "人生如麻将，一见钟情叫天胡",
    "一样的游戏，不一样的体验",
    "只要思想不滑坡，办法总比困难多！",
    "搏一搏，单车变摩托，再博一博，路虎变航母",
    "拼一拼 草房变洋房。 再拼一拼，夏利变宾利",
    "哪家小孩天天哭，哪个牌友天天输？",
    "爱拼才会赢,敢下就会红!要想富,下重注!",
    "你还记得大明湖畔的夏雨荷吗",
    "岁月是把杀猪刀，紫了葡萄，黑了木耳，软了香蕉",
    "打多打少全凭一个缘字，打多打少别声张",
    "人生只有走出来的精彩，没有等出来的辉煌。",
    "人生在世无非是让别人笑笑，偶尔笑笑别人",
    "只有一条路不能选择——那就是放弃的路",
    "下次对决时，我也不会是今天的我",
    "错不了，就是你，你就是我一辈子的劲敌！",
    "需要两个实力相当的凑在一起，才能够达到神乎其技！",
    "胜者才有资格往上爬！",
    "一想到有你这样的牌友，就觉得不枉选了这条路",
    "尊重对手的加注，尤其是反加",
    "针对不同的对手要有不同的打法",
    "不是无路可走的时候，最好不要起手就全压",
    "冲动是魔鬼，心态好，运气自然来",
    "虽然保守不是最好的策略，但是冲动只会让你结束的更快。",
    "每个牌局好似人生，该出手时就出手，不因为错过而后悔",
    "中国的老话，软的怕硬的，硬的怕不要命的",
    "唯一比凶猛的对手更可怕的是你的错误打法",
    "弃牌是最常见的策略，牌不好就等下一次机会",
    "大牌要你命，小牌能救命",
    "只要你活的比对手时间长你就赢了",
    "只要你不是最大的牌，你就要想对手下重注的理由",
    "尊重对手就是尊重自己的钱包",
    "小输十把没关系，大赢一把就OK",
}

randomSort(LOADING_SENTENCES_ARR)

